<template>
  <div>
    <h1 slot="header">This is My Page!!</h1> 
    <p>
     嘘か、糞の役にも立たないゴミ情報が多すぎる。

おかげで何かを調べたい時には英語で検索して、日本語の検索結果を排除する設定にせざるを得なくなってる。

日本人のITエンジニアの90％は人に何かを教えられるレベルには達してない

QAサイトが英語圏もゴミなのは同意です。

でもね、日本語圏にはアカデミック界隈の情報がすくないんですよ。何かのアルゴリズム、何かの数値処理など、理論的な背景から実装までを知りたいと思った時に、全く役に立たないんですね。そりゃね、Windowsでアプリケーションを作りたくて、UIコントロールの機能や使い方を知りたい程度なら、日本語情報も役に立ちますよ。欲しい情報が専門化するほど、日本語情報はないか、あってもゴミなんです。
    </p>
    <p slot="footer">This is Footer</p>
  </div>
</template>

<script>
  export default {
    name: 'MypageContent'
  }
</script>
